Конфигурация/src/DataProcessors/ЗагрузкаМетаданныхКонфигурацииИзФайла/ЗагрузкаМетаданныхКонфигурацииИзФайла.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:DataProcessor>
  <name>ЗагрузкаМетаданныхКонфигурацииИзФайла</name>
</mdclass:DataProcessor>

Конфигурация/src/Catalogs/СхемаДанных/СхемаДанных.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>СхемаДанных</name>
  <tabularSections>
    <name>ТЧКлассы</name>
    <attributes>
      <name>Класс</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>10</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конфигурация/src/Catalogs/Классы/Классы.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>Классы</name>
  <attributes>
    <name>ТипКласса</name>
    <comment>(Документ, справочник и т.д.)</comment>
    <type>
      <types>CatalogRef.Классы</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ТЧРеквизиты</name>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>CatalogRef.Классы</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧСтруктураТаблиц</name>
    <attributes>
      <name>ИмяТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧРеквизитыТаблиц</name>
    <attributes>
      <name>ИмяТаблицы</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>20</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяРеквизита</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ТипРеквизита</name>
      <type>
        <types>CatalogRef.Классы</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ТЧКоманды</name>
    <attributes>
      <name>ИмяКоманды</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ИмяАлгоритма</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ДействияАлгоритма</name>
      <type>
        <types>String</types>
      </type>
    </attributes>
    <attributes>
      <name>Примечание</name>
      <type>
        <types>String</types>
        <stringQualifiers>
          <length>255</length>
        </stringQualifiers>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

Конфигурация/src/DataProcessors/ЗагрузкаМетаданныхКонфигурацииИзФайла/Forms/Форма/Module.bsl
&НаКлиенте
Процедура Загрузить(Команда)
	ЗагрузитьНаСервере();
КонецПроцедуры

&НаСервере
Процедура ЗагрузитьНаСервере()
	
	ОчиститьСправочник();
	
	ДанныеИзФайла = ЗначениеИзФайла(ПутьКФайлу);
	
	СоответствияКлассов = Новый Соответствие;
	
	Для каждого Элемент из ДанныеИзФайла Цикл
		
		СоздатьКласс(Элемент.Ключ, Элемент.Значение, СоответствияКлассов);	
			
	КонецЦикла;
	
	Схема = Справочники.СхемаДанных.НайтиПоНаименованию(НаименованиеСхемыДанных);   
	
	Если ЗначениеЗаполнено(Схема) Тогда      
		
		СхемаОбъект = Схема.ПолучитьОбъект();
		
	Иначе
		
		СхемаОбъект = Справочники.СхемаДанных.СоздатьЭлемент();
		СхемаОбъект.Наименование = НаименованиеСхемыДанных;
		
	КонецЕсли;
	
	СхемаОбъект.ТЧКлассы.Очистить();
	
	Для каждого элемент из СоответствияКлассов Цикл    
		
		стр = СхемаОбъект.ТЧКлассы.Добавить(); 
		стр.Класс = элемент.Значение.ссылка;
		
	КонецЦикла; 
	
	СхемаОбъект.Записать();
	
КонецПроцедуры

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ПутьКФайлу = "D:\ФайлВыгрузкиМетаданных.txt";
	НаименованиеСхемыДанных = "Схема";
	
КонецПроцедуры

&НаСервере
Процедура ОчиститьСправочник() 
	
	Выборка = Справочники.Классы.Выбрать();
	
	Пока Выборка.Следующий() Цикл
		
		ОбъектКласс = Выборка.Ссылка.ПолучитьОбъект();
		ОбъектКласс.Удалить();
		
	КонецЦикла;
	
КонецПроцедуры 

&НаСервере
Функция СоздатьКласс(КлючКласса, Таблицы, СоответствияКлассов, ЗагружатьТаблицы = Истина)
	
	Класс = СоответствияКлассов.Получить(КлючКласса);
	
	Если Класс = Неопределено или КлючКласса = "Составной" Тогда	
		
		Класс = Справочники.Классы.СоздатьЭлемент();
		Класс.Наименование = КлючКласса; 
		Класс.Записать();	
		СоответствияКлассов.Вставить(КлючКласса, Класс);
		
	КонецЕсли;
	
	Для каждого Строка из Таблицы["ТЧРеквизиты"] Цикл
			
		СоздатьТипыПоСтроке(Строка, Таблицы, СоответствияКлассов);	
		
	КонецЦикла;  
	
	Для каждого Строка из Таблицы["ТЧРеквизитыТаблиц"] Цикл
			
		СоздатьТипыПоСтроке(Строка, Таблицы, СоответствияКлассов);	
		
	КонецЦикла;
	
	Если ЗагружатьТаблицы Тогда     
		
		Класс.ТЧРеквизиты.Загрузить(Таблицы["ТЧРеквизиты"]);
		Класс.ТЧСтруктураТаблиц.Загрузить(Таблицы["ТЧСтруктураТаблиц"]);
		Класс.ТЧРеквизитыТаблиц.Загрузить(Таблицы["ТЧРеквизитыТаблиц"]);
		
	КонецЕсли;
	
	Класс.Записать();	
	
	Возврат Класс.Ссылка;
	
КонецФункции

&НаСервере
Процедура СоздатьТипыПоСтроке(Строка, Таблицы, СоответствияКлассов)
	
	МассивТипов = СтрРазделить(Строка.ТипРеквизита, ";", ложь);
		
	ТаблицыТипов = Новый Соответствие;
	ТаблицыТипов.Вставить("ТЧРеквизиты", Таблицы["ТЧРеквизиты"].СкопироватьКолонки());   
	ТаблицыТипов.Вставить("ТЧСтруктураТаблиц", Таблицы["ТЧСтруктураТаблиц"].СкопироватьКолонки()); 
	ТаблицыТипов.Вставить("ТЧРеквизитыТаблиц", Таблицы["ТЧРеквизитыТаблиц"].СкопироватьКолонки());

	Если МассивТипов.Количество()>1 Тогда
		
		Для каждого элемент из МассивТипов Цикл 
			
			Стр = ТаблицыТипов["ТЧРеквизиты"].Добавить();
			Стр.ИмяРеквизита = СокрЛП(элемент); 
			Стр.ТипРеквизита = СокрЛП(элемент);
			
		КонецЦикла;

		ИмяКлассаТипа = "Составной";
		ЗагружатьТаблицы = истина;
		
	Иначе  
		
		ИмяКлассаТипа = МассивТипов[0];
		ЗагружатьТаблицы = Ложь;
		
	КонецЕсли; 
	
	КлассТипа = СоздатьКласс(ИмяКлассаТипа, ТаблицыТипов, СоответствияКлассов, ЗагружатьТаблицы); 
	
	Строка.ТипРеквизита = КлассТипа.ссылка;

КонецПроцедуры
